load_test_1/summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
01 - Login Request,100,23782,7781,39819,9370.49,0.000%,2.01853,1.37,0.53,696.8
02 - Get All Products,100,9052,506,17439,4943.97,0.000%,5.73033,2.17,1.47,388.0
03 - Show Single Product,100,8817,171,17218,4990.27,0.000%,5.80417,2.11,1.50,372.0
04 - Purchase Request (Optimistic),100,10099,494,19771,5726.09,0.000%,5.05536,2.56,1.60,517.9
05 - Purchase Request (Pessimistic),100,10044,195,20052,5800.29,0.000%,4.98480,2.52,1.58,516.9
TOTAL,500,12359,171,39819,8579.26,0.000%,4.03008,1.96,1.14,498.3